# 第2章：UNIXコマンド

## 10.行数のカウント

行数をカウントせよ．確認にはwcコマンドを用いよ．

In [4]:
import pandas as pd
df_popular_name = pd.read_table("popular-names.txt", header=None)
print("行数は：{}".format(len(df_popular_name)))
df_popular_name

行数は：2780

              0  1      2     3
0          Mary  F   7065  1880
1          Anna  F   2604  1880
2          Emma  F   2003  1880
3     Elizabeth  F   1939  1880
4        Minnie  F   1746  1880
...         ... ..    ...   ...
2775   Benjamin  M  13381  2018
2776     Elijah  M  12886  2018
2777      Lucas  M  12585  2018
2778      Mason  M  12435  2018
2779      Logan  M  12352  2018

[2780 rows x 4 columns]

## 11.タブをスペースに置換

タブ1文字につきスペース1文字に置換せよ．確認にはsedコマンド，trコマンド，もしくはexpandコマンドを用いよ．

In [8]:
file_popular_name = open('popular-names.txt', 'r')
data_popular_name = file_popular_name.read()
file_popular_name.close()
data_ans11 = data_popular_name.replace('\t', ' ')
file_ans11 = open('ans11.txt', 'w')
file_ans11.write(data_ans11)
file_ans11.close()